RoR_Jour_3/kiki_half/app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `price`, `title`, `updated_at`) VALUES ('2017-04-24 18:19:16', 'une description', 0.0, 'un titre', '2017-04-24 18:19:16')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `description` = 'une fffdescription', `updated_at` = '2017-04-24 18:40:01' WHERE `products`.`id` = 3
---
  def update
    respond_to do |format|
      if @product.update(product_params)