RoR_Jour_3/kiki/app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `price`, `title`, `updated_at`, `user_id`) VALUES ('2017-04-26 14:28:48', 'une description', 11.0, 'jhjh1', '2017-04-26 14:28:48', 1)
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user


    respond_to do |format|
      if @product.save

UPDATE `products` SET `description` = 'une fffdescription', `updated_at` = '2017-04-24 18:40:01' WHERE `products`.`id` = 3
---
  def update
    respond_to do |format|
      if @product.update(product_params)